/*
 * Name: OgreTextFinderLocalizable.strings
 * Project: OgreKit
 *
 * Creation Date: Jan 22 2004
 * Author: Isao Sonobe <sonoisa@gmail.com>
 * Copyright: Copyright (c) 2004-2020 Isao Sonobe, All rights reserved.
 * License: OgreKit License
 *
 * Encoding: UTF16
 * Tabsize: 4
 */

"Find"			= "Find";	/* the title of the "Find" menu */
"Replace"		= "Replace";
"Find All"		= "Find All";
"Replace All"   = "Replace All";
"Highlight"		= "Highlight";

/* the titles of buttons */
"OK"		= "OK";
"Cancel"	= "Cancel";

/* progrss messages */
" (%dsec remaining)"        = " (%dsec remaining)";    // sec: second
// Find All
"%d string found."          = "%d string found.";
"%d strings found."         = "%d strings found.";
// Replace All
"%d string replaced."       = "%d string replaced.";
"%d strings replaced."      = "%d strings replaced.";
// Highlight
"%d string highlighted."    = "%d string highlighted.";
"%d strings highlighted."   = "%d strings highlighted.";

/* finish messages */
// not found
"Not found. (%.3fsec)"							= "Not found. (%.3fsec)";
"Not found. (canceled, %.3fsec)"				= "Not found. (canceled, %.3fsec)";
// Find All
"%d string found. (%.3fsec)"					= "%d string fouond. (%.3fsec)";
"%d strings found. (%.3fsec)"					= "%d strings found. (%.3fsec)";
"%d string found. (canceled, %.3fsec)"			= "%d string found. (canceled, %.3fsec)";
"%d strings found. (canceled, %.3fsec)"			= "%d strings found. (canceled, %.3fsec)";
// Replace All
"%d string replaced. (%.3fsec)"					= "%d string replaced. (%.3fsec)";
"%d strings replaced. (%.3fsec)"				= "%d strings replaced. (%.3fsec)";
"%d string replaced. (canceled, %.3fsec)"		= "%d string replaced. (canceled, %.3fsec)";
"%d strings replaced. (canceled, %.3fsec)"		= "%d strings replaced. (canceled, %.3fsec)";
// Highlight
"%d string highlighted. (%.3fsec)"				= "%d string highlighted. (%.3fsec)";
"%d strings highlighted. (%.3fsec)"				= "%d strings highlighted. (%.3fsec)";
"%d string highlighted. (canceled, %.3fsec)"	= "%d string highlighted. (canceled, %.3fsec)";
"%d strings highlighted. (canceled, %.3fsec)"   = "%d strings highlighted. (canceled, %.3fsec)";

/* error messages */
"Error! Uneditable."	= "Error! Uneditable."; /* a target TextView is not editable */
"Missing."				= "Missing.";			/* a found string became missing */

/* Find Result Window*/
"Find Result for \"%@\""        = "Find Result for \"%@\"";
"%d string found."				= "%d string found.";
"%d strings found."				= "%d strings found.";
"Found in %d item."				= "Found in %d item.";
"Found in %d items."            = "Found in %d items.";
"Find String: %@"               = "Find String: %@";
"Line"                          = "Line";
"Found String"                  = "Found String";
"Live Update"                   = "Live Update";
"Selected string not found."	= "Selected string not found."; /* error message */

/* preparation */
"Favorites"					= "Favorites";
"Custom Find/Replace"		= "Custom Find/Replace";
"Definition"				= "Definition";
"Serial (Pipe)"				= "Serial (Pipe)";
"Parallel (Join)"			= "Parallel (Join)";
"Multifile Find/Replace"	= "Multifile Find/Replace";
